const express = require('express');
const cors = require('cors');

const app = express();
const port = process.env.PORT || 3000;

app.use(cors({ origin: '*' }));

const data = {
    "name": "Олександр",
    "surname": "Загоруйко",
    "birth_date": "10 березня 1989 року",
    "location": "Одеса, Україна",
    "interests": [
        "Програмування",
        "Малювання акрилом",
        "Французька мова",
        "Вирощування авокадо",
        "Подорожі",
        "Гітара"
    ],
    "current_project": "Андроїд додаток - Навчання грі на сопілці",
    "dream": "Переїзд до Франції та подорожі",
    "facts": [
        "Викладач програмування",
        "Вважає, що викладання — це покликання, а не просто робота",
        "Користується Duolingo вже 1185+ днів для вивчення французької",
        "Любить котів і собак",
        "Вирощує авокадо, сукуленти та тангори муркотт",
        "Вважає себе схожим на сукулент, адже виживає в якихось надскладних умовах",
        "Живе в Одесі",
        "Вважає, що найважливіші речі в житті — це свобода і самореалізація, а не оце все",
        "Не любить нав’язування чужих думок і завжди залишається при своєму",
        "Часто розмірковує про долю і призначення",
        "Любить архітектуру готичних соборів і старих європейських міст",
        "Улюблений серіал - Відчайдушні домогосподарки",
        "Надихається людьми, які йдуть своїм шляхом, попри все",
        "Слухає EDM Trance та Ethnic",
        "Вважає себе інтровертом, але може бути говірким у комфортній обстановці",
        "Планує відкрити храм Фреї та цікавиться міфологією",
        "Має 5 додатків у плеймаркеті",
        "Розробляє андроїд-додаток для вивчення гри на сопілці",
        "Грає на фортепіано, мелодиці, акордеоні/виборному баяні, сопілці/блок-флейті, варгані/дримбі, укулеле, калимбі, отаматоні, трикутнику та бубні",
        "Вивчає гру на гітарі",
        "Любить співати в караоке",
        "Записався на курси з Figma",
        "Намагається перенести старий проєкт з ActionScript на HTML/JavaScript",
        "Створював Telegram-ботів на Python"
    ]
};

app.get('/api/info', (req, res) => {
    res.json(data);
});

app.listen(port, () => {
    console.log(`Сервер запущено на порту ${port}`);
});
